{"format": "graph-model", "generatedBy": "2.3.1", "convertedBy": "TensorFlow.js Converter v2.7.0", "userDefinedMetadata": {"signature": {"outputs": {"output": {"name": "output"}}}}, "modelTopology": {"node": [{"name": "strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "Const_12", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "input", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "9"}, {"size": "24"}, {"size": "24"}, {"size": "24"}]}}}}, {"name": "BatchNormalization_0/mul", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "9"}, {"size": "1"}, {"size": "1"}, {"size": "1"}]}}}}}, {"name": "BatchNormalization_0/sub", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "9"}, {"size": "1"}, {"size": "1"}, {"size": "1"}]}}}}}, {"name": "transpose_1/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "5"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "split", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "9"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "blocks.0.1.bias", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "transpose_2/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "5"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "transpose_4/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "5"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "split_2", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}}}, {"name": "blocks.0.3.bias", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "transpose_5/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "5"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "transpose_7/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "5"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "split_4", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "blocks.0.5.bias", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "transpose_8/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "5"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "transpose_9/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "5"}]}}}}}, {"name": "transpose_10/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "5"}]}}}}}, {"name": "BatchNormalization_8/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "64"}, {"size": "1"}, {"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "BatchNormalization_8/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "64"}, {"size": "1"}, {"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "transpose_12/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "5"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "split_6", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}}}, {"name": "blocks.1.1.bias", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "transpose_13/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "5"}]}}}}}, {"name": "transpose_15/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "5"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "split_8", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}}}, {"name": "blocks.1.3.bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "transpose_16/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "5"}]}}}}}, {"name": "transpose_18/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "5"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "split_10", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}}}, {"name": "blocks.1.5.bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "transpose_19/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "5"}]}}}}}, {"name": "ConstantFolding/split_12-folded-1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "strided_slice_1/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "strided_slice_1/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "strided_slice_1/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "Const_13", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "flatten/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "flatten/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "flatten/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "flatten/Reshape/shape/1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "transpose_20", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "512"}]}}}}}, {"name": "mul_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "transpose_21", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "2048"}]}}}}}, {"name": "mul_3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2048"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "BatchNormalization_0/mul_1", "op": "Mul", "input": ["input", "BatchNormalization_0/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "BatchNormalization_0/add_1", "op": "AddV2", "input": ["BatchNormalization_0/mul_1", "BatchNormalization_0/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "transpose_1", "op": "Transpose", "input": ["BatchNormalization_0/add_1", "transpose_1/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "convolution", "op": "Conv3D", "input": ["transpose_1", "split"], "attr": {"strides": {"list": {"i": ["1", "1", "1", "1", "1"]}}, "data_format": {"s": "TkRIV0M="}, "dilations": {"list": {"i": ["1", "1", "1", "1", "1"]}}, "padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}}}, {"name": "Add", "op": "Add", "input": ["convolution", "blocks.0.1.bias"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "transpose_2", "op": "Transpose", "input": ["Add", "transpose_2/perm"], "attr": {"T": {"type": "DT_FLOAT"}, "Tperm": {"type": "DT_INT32"}}}, {"name": "Relu_2", "op": "Relu", "input": ["transpose_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "transpose_4", "op": "Transpose", "input": ["Relu_2", "transpose_4/perm"], "attr": {"T": {"type": "DT_FLOAT"}, "Tperm": {"type": "DT_INT32"}}}, {"name": "convolution_1", "op": "Conv3D", "input": ["transpose_4", "split_2"], "attr": {"padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1", "1"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1", "1"]}}, "data_format": {"s": "TkRIV0M="}}}, {"name": "Add_1", "op": "Add", "input": ["convolution_1", "blocks.0.3.bias"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "transpose_5", "op": "Transpose", "input": ["Add_1", "transpose_5/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "Relu_4", "op": "Relu", "input": ["transpose_5"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "transpose_7", "op": "Transpose", "input": ["Relu_4", "transpose_7/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "convolution_2", "op": "Conv3D", "input": ["transpose_7", "split_4"], "attr": {"strides": {"list": {"i": ["1", "1", "1", "1", "1"]}}, "padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1", "1"]}}, "data_format": {"s": "TkRIV0M="}}}, {"name": "Add_2", "op": "Add", "input": ["convolution_2", "blocks.0.5.bias"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "transpose_8", "op": "Transpose", "input": ["Add_2", "transpose_8/perm"], "attr": {"T": {"type": "DT_FLOAT"}, "Tperm": {"type": "DT_INT32"}}}, {"name": "Relu_6", "op": "Relu", "input": ["transpose_8"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "transpose_9", "op": "Transpose", "input": ["Relu_6", "transpose_9/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "MaxPool3D", "op": "MaxPool3D", "input": ["transpose_9"], "attr": {"T": {"type": "DT_FLOAT"}, "ksize": {"list": {"i": ["1", "2", "2", "2", "1"]}}, "padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkRIV0M="}, "strides": {"list": {"i": ["1", "2", "2", "2", "1"]}}}}, {"name": "transpose_10", "op": "Transpose", "input": ["MaxPool3D", "transpose_10/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "BatchNormalization_8/mul_1", "op": "Mul", "input": ["transpose_10", "BatchNormalization_8/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "BatchNormalization_8/add_1", "op": "AddV2", "input": ["BatchNormalization_8/mul_1", "BatchNormalization_8/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "transpose_12", "op": "Transpose", "input": ["BatchNormalization_8/add_1", "transpose_12/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "convolution_3", "op": "Conv3D", "input": ["transpose_12", "split_6"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1", "1"]}}, "data_format": {"s": "TkRIV0M="}, "padding": {"s": "VkFMSUQ="}}}, {"name": "Add_3", "op": "Add", "input": ["convolution_3", "blocks.1.1.bias"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "transpose_13", "op": "Transpose", "input": ["Add_3", "transpose_13/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "Relu_10", "op": "Relu", "input": ["transpose_13"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "transpose_15", "op": "Transpose", "input": ["Relu_10", "transpose_15/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "convolution_4", "op": "Conv3D", "input": ["transpose_15", "split_8"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkRIV0M="}, "dilations": {"list": {"i": ["1", "1", "1", "1", "1"]}}, "padding": {"s": "VkFMSUQ="}, "strides": {"list": {"i": ["1", "1", "1", "1", "1"]}}}}, {"name": "Add_4", "op": "Add", "input": ["convolution_4", "blocks.1.3.bias"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "transpose_16", "op": "Transpose", "input": ["Add_4", "transpose_16/perm"], "attr": {"T": {"type": "DT_FLOAT"}, "Tperm": {"type": "DT_INT32"}}}, {"name": "Relu_12", "op": "Relu", "input": ["transpose_16"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "transpose_18", "op": "Transpose", "input": ["Relu_12", "transpose_18/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "convolution_5", "op": "Conv3D", "input": ["transpose_18", "split_10"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkRIV0M="}}}, {"name": "Add_5", "op": "Add", "input": ["convolution_5", "blocks.1.5.bias"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "transpose_19", "op": "Transpose", "input": ["Add_5", "transpose_19/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "Relu_14", "op": "Relu", "input": ["transpose_19"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Mean", "op": "Mean", "input": ["Relu_14", "ConstantFolding/split_12-folded-1"], "attr": {"T": {"type": "DT_FLOAT"}, "keep_dims": {"b": true}, "Tidx": {"type": "DT_INT32"}}}, {"name": "Shape_1", "op": "Shape", "input": ["Mean"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "strided_slice", "op": "StridedSlice", "input": ["Shape_1", "strided_slice/stack", "strided_slice/stack_1", "strided_slice/stack_2"], "attr": {"ellipsis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}}}, {"name": "strided_slice_1", "op": "StridedSlice", "input": ["Shape_1", "strided_slice_1/stack", "strided_slice_1/stack_1", "strided_slice_1/stack_2"], "attr": {"new_axis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "shrink_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}}}, {"name": "Prod", "op": "Prod", "input": ["strided_slice", "Const_12"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}, "T": {"type": "DT_INT32"}}}, {"name": "Prod_1", "op": "Prod", "input": ["strided_slice_1", "Const_13"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}, "T": {"type": "DT_INT32"}}}, {"name": "Reshape_8/shape", "op": "Pack", "input": ["Prod", "Prod_1"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}, "axis": {"i": "0"}}}, {"name": "Reshape_8", "op": "Reshape", "input": ["Mean", "Reshape_8/shape"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "Relu_17", "op": "Relu", "input": ["Reshape_8"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "flatten/Shape", "op": "Shape", "input": ["Relu_17"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "flatten/strided_slice", "op": "StridedSlice", "input": ["flatten/Shape", "flatten/strided_slice/stack", "flatten/strided_slice/stack_1", "flatten/strided_slice/stack_2"], "attr": {"end_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "T": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}}}, {"name": "flatten/Reshape/shape", "op": "Pack", "input": ["flatten/strided_slice", "flatten/Reshape/shape/1"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "2"}}}, {"name": "flatten/Reshape", "op": "Reshape", "input": ["Relu_17", "flatten/Reshape/shape"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "MatMul", "op": "MatMul", "input": ["flatten/Reshape", "transpose_20"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "transpose_b": {"b": false}}}, {"name": "add_6", "op": "AddV2", "input": ["MatMul", "mul_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Relu_19", "op": "Relu", "input": ["add_6"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MatMul_1", "op": "MatMul", "input": ["Relu_19", "transpose_21"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "add_7", "op": "AddV2", "input": ["MatMul_1", "mul_3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "output", "op": "Sigmoid", "input": ["add_7"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 440}}, "weightsManifest": [{"paths": ["group1-shard1of2.bin", "group1-shard2of2.bin"], "weights": [{"name": "strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "Const_12", "shape": [1], "dtype": "int32"}, {"name": "BatchNormalization_0/mul", "shape": [1, 9, 1, 1, 1], "dtype": "float32"}, {"name": "BatchNormalization_0/sub", "shape": [1, 9, 1, 1, 1], "dtype": "float32"}, {"name": "transpose_1/perm", "shape": [5], "dtype": "int32"}, {"name": "split", "shape": [3, 3, 3, 9, 64], "dtype": "float32"}, {"name": "blocks.0.1.bias", "shape": [64], "dtype": "float32"}, {"name": "transpose_2/perm", "shape": [5], "dtype": "int32"}, {"name": "transpose_4/perm", "shape": [5], "dtype": "int32"}, {"name": "split_2", "shape": [3, 3, 3, 64, 64], "dtype": "float32"}, {"name": "blocks.0.3.bias", "shape": [64], "dtype": "float32"}, {"name": "transpose_5/perm", "shape": [5], "dtype": "int32"}, {"name": "transpose_7/perm", "shape": [5], "dtype": "int32"}, {"name": "split_4", "shape": [3, 3, 3, 64, 64], "dtype": "float32"}, {"name": "blocks.0.5.bias", "shape": [64], "dtype": "float32"}, {"name": "transpose_8/perm", "shape": [5], "dtype": "int32"}, {"name": "transpose_9/perm", "shape": [5], "dtype": "int32"}, {"name": "transpose_10/perm", "shape": [5], "dtype": "int32"}, {"name": "BatchNormalization_8/mul", "shape": [1, 64, 1, 1, 1], "dtype": "float32"}, {"name": "BatchNormalization_8/sub", "shape": [1, 64, 1, 1, 1], "dtype": "float32"}, {"name": "transpose_12/perm", "shape": [5], "dtype": "int32"}, {"name": "split_6", "shape": [3, 3, 3, 64, 64], "dtype": "float32"}, {"name": "blocks.1.1.bias", "shape": [64], "dtype": "float32"}, {"name": "transpose_13/perm", "shape": [5], "dtype": "int32"}, {"name": "transpose_15/perm", "shape": [5], "dtype": "int32"}, {"name": "split_8", "shape": [3, 3, 3, 64, 64], "dtype": "float32"}, {"name": "blocks.1.3.bias", "shape": [64], "dtype": "float32"}, {"name": "transpose_16/perm", "shape": [5], "dtype": "int32"}, {"name": "transpose_18/perm", "shape": [5], "dtype": "int32"}, {"name": "split_10", "shape": [3, 3, 3, 64, 64], "dtype": "float32"}, {"name": "blocks.1.5.bias", "shape": [64], "dtype": "float32"}, {"name": "transpose_19/perm", "shape": [5], "dtype": "int32"}, {"name": "ConstantFolding/split_12-folded-1", "shape": [3], "dtype": "int32"}, {"name": "strided_slice_1/stack", "shape": [1], "dtype": "int32"}, {"name": "strided_slice_1/stack_1", "shape": [1], "dtype": "int32"}, {"name": "strided_slice_1/stack_2", "shape": [1], "dtype": "int32"}, {"name": "Const_13", "shape": [1], "dtype": "int32"}, {"name": "flatten/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "flatten/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "flatten/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "flatten/Reshape/shape/1", "shape": [], "dtype": "int32"}, {"name": "transpose_20", "shape": [64, 512], "dtype": "float32"}, {"name": "mul_1", "shape": [512], "dtype": "float32"}, {"name": "transpose_21", "shape": [512, 2048], "dtype": "float32"}, {"name": "mul_3", "shape": [2048], "dtype": "float32"}]}]}